# Solid Utils Compute Is Topologically Closed Method

Source: https://www.revitapidocs.com/2026/4849b82c-a63d-db1b-89f5-d306b4351a04.htm

---

| Solid Utils Compute Is Topologically Closed Method |
| --- |

Compute whether the input Solid is topologically closed.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool ComputeIsTopologicallyClosed(
	Solid geometry
)
```

```
Public Shared Function ComputeIsTopologicallyClosed (
	geometry As Solid
) As Boolean
```

```
public:
static bool ComputeIsTopologicallyClosed(
	Solid^ geometry
)
```

```
static member ComputeIsTopologicallyClosed :
        geometry : Solid -> bool
```

#### Parameters

geometry Solid
:   The solid or shell geometry to test.

#### Return Value

Boolean
True if the geometry is topologically closed, false otherwise. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks A solid is topologically closed if every face has at least one edge loop and
 every edge is shared by exactly two faces. If the geometry contains multiple
 connected components, the function returns true if and only if every connected
 component is topologically closed. See Also

#### Reference

SolidUtils Class Autodesk.Revit.DB Namespace